[
	{
		"name": "Blindfolds",
		"top": "blindfolding [2] partner",
		"bottom": "being blindfolded by [2] partner",
		"description": "A blindfold is a piece of fabric that can be secured around the head and placed over the eyes to block sight. Blindfolds are often used in sex play because when sight is blocked, the remaining senses of smell, taste, touch and hearing can be amplified; some also find the element of surprise involved in being unable to see particularly stimulating.\r\n\n Blindfolds can be used to heighten a partner's senses during sex play. They are often used in light bondage practices. The removal of vision adds another dimension to sex by forcing one partner to rely on their other senses. In addition, the partner who is wearing the blindfold is submitting to the partner without one, which many people find arousing. In the instance that a male partner may experience orgasm quickly, using a blindfold may inhibit the problem by removing visual stimulation, which many men find particularly exciting. Blindfolded sex play also can result in better, more varied communication because partners are forced to rely on verbal or tactile cues, rather than visual ones."
	},{
		"name": "Bondage",
		"top": "tying [2] partner up",
		"bottom": "being tied up by [2] partner",
		"description": "Bondage is a form of sex play in which one person restrains another for sexual pleasure. There are also people who practice self-bondage during masturbation. As the B in the acronym, bondage is commonly practiced in the BDSM community. However, many couples who identify as vanilla can also enjoy experimenting with sexual bondage.\r\n\n Physical bondage can involve anything from handcuffs, blindfolds and basic restraints, to ropes, gags, sex furniture, and even cages. Household items like neckties and pantyhose can also be used as bondage aids.\r\n\n In most bondage activities, a dominant partner (often called the \"rigger\") restrains a submissive partner (sometimes called a \"bunny\") using one or more of these devices. They may fasten body parts, such as ankles or wrists, together. They may also fasten the submissive's body to ordinary household furniture or sex furniture. The fastenings may be purely functional or aesthetically pleasing, as with the Japanese rope art of kinbaku.They may use a single restraint or many, as with mummification and sensory deprivation. Some dominants like to restrain their partners and use them as human furniture.\r\n\n Some couples prefer psychological bondage, where the dominant orders the submissive to stay still or hold a position. Keen to obey the dominant, the submissive doesn't need any physical restraints to do as they are instructed. Many dominants give their submissives a collar to remind them of their obligation to submit, even when they are not physically restrained.\r\n\n The process of applying bondage restraints can be very arousing for the partners. Once the submissive is fully restrained, the dominant may tease them with toys or their hands, have oral or penetrative sex with them, or use them in any way that they see fit according to what has been agreed upon.",
		"safety": "Safety is an important consideration when playing with bondage. Restraints should be secure without being too tight, especially around joints, the neck, and major arteries. As a rule, you should be able to slide one or two fingers between the skin and restraint or harness. Having a pair of safety shears (that cut through tough materials but are blunted at the ends so you don't accidentally stab anyone) on hand is imperative.\r\n\n"
	},{
		"name": "Butt Plugs",
		"top": "putting a butt plug in [2] partner",
		"bottom": "wearing a butt plug for [2] partner",
		"description": "A butt plug is a type of sex toy that does exactly as the name promises: plugs the anus and rectum. It is used for sexual pleasure and to dilate the anus for anal sex. Butt plugs come in many different shapes and sizes but most are narrowest at the top (for easy entry) then widen to their widest point before narrowing down at the base, where it is held in place by the user's sphincter muscles. Below the base you will most often find a flared bottom to keep the butt plug from moving too far into the anus. A basic butt plug is most commonly used to give slight stimulation to all those nerve endings in the anus while you or your partner tackles other tasks like vaginal stimulation, nipple stimulation, a blow job, or other sexual acts. The butt plug is not meant to be used in an in-and-out motion. It simply acts as a plug. Once removed, it leaves the anus ready for something a bit bigger like a penis, vibrator, dildo, or strap-on."
	},{
		"name": "Candle Wax",
		"top": "dripping hot candle wax on [2] partner",
		"bottom": "having hot candle wax dripped on [1]",
		"description": "Candle wax torture is the practice of dripping hot wax from a candle onto the skin of a submissive during a BDSM play session. The hot candle wax burns the skin in a mild way. This burn is enough to cause pain, but when done correctly (including using the proper sort of candles), it's rarely strong enough to really damage the skin.\r\n\n During candle wax torture, dominants may vary the height and location they're dripping wax. They might make shapes with the wax, layer the wax up on the skin, and play in other ways.\r\n\n Candle wax torture can reinforce the roles of a couple in a BDSM-style relationship. Dominant individuals enjoy taking control of the candle wax torture while submissives can feel even more vulnerable with dominants in charge of how much wax they receive, when it drips, and where.\r\n\n Candle wax torture is also very erotic. Wax creates a pleasurable pain on impact which can be very arousing. Dominants also typically find the power candle wax torture gives them a real turn-on.",
		"safety": "Soy candles are the safest candles for candle wax torture, as the wax cools quickly and is non-irritating. Scented and paraffin candles don't burn as hot, but their wax takes longer to cool. Brighter colored candles typically burn hotter than pale ones due to their dyes.\r\n\n Dominants should always test the candle wax on themselves to ensure it's not too hot. They should also communicate with their submissives, as individuals have different pain thresholds.\r\n\n Wax cools as it travels through the air, so holding candles high is the safest technique. Be careful when dripping wax near the face and eyes. Wax should never be dripped onto the genitals or open wounds.\r\n\n Candle wax torture can also be a bit messy. Have the submissive lie on a plastic sheet or rag to avoid spoiling bed sheets, the floor, or another play surface. Flammable items should also be removed from the play space to prevent fires.\r\n\n Removing candle wax after candle wax torture can be a little painful and difficult, especially in places with a lot of hair."
	},{
		"name": "Collars",
		"top": "putting a collar on [2] partner",
		"bottom": "wearing a collar for [2] partner",
		"description": "A collar is a restraint that is sometimes placed around the neck of bottom partners in BDSM play. It is not uncommon for dominants to wear them as well. Often, submissive partners that regularly wear collars are referred to as being \"collared.\"\r\n\n At times, formal collaring ceremonies are held. These ceremonies can be likened to wedding ceremonies, with the collar being nearly equivalent to a wedding ring, as they signify the start of a special relationship between a dominant and a submissive.\r\n\n Collars can be made of nearly any material, including rubber and even metal, but the most common type of BDSM collar is made from black leather. Many collars also have one or more metal D-rings or O-rings making it easy to attach a leash. Collars might also be plain or adorned.\r\n\n Some people who enjoy BDSM forgo the usual collar and opt for other methods of collaring and use a necklace instead."
	},{
		"name": "Gags",
		"top": "gagging [2] partner",
		"bottom": "wearing a gag for [2] partner",
		"description": "A gag is a device worn in or on the mouth to prevent the wearer from speaking. Gags are commonly used in conjunction with bondage during BDSM play and are usually worn by submissives to give the dominant partner more control. Gags can be used to make a submissive more helpless and as a form of punishment or humiliation.\r\n\n Ball gags are perhaps one of the most popular types of gags used during BDSM play. These gags have soft, solid rubber balls that are inserted into the mouth with straps to secure them to the head. Wiffle ball gags are very similar, but they have small plastic balls with several holes in them making it easier for the wearer to breath. Open-mouth gags are designed to keep the mouth open so the wearer can perform oral sex. Bit gags have rubber bits that are inserted into the mouth for pony play. Other gags include penis gags, forniphilic gags, and cleave gags.",
		"safety": "Safety is a big issue when using a gag during BDSM play because there is a danger of asphyxiation when a person's airways are obstructed. Always make sure that a gag fits the wearer and is not too tight. Never leave a gagged submissive alone. Also, never obstruct the wearer's nose when using a gag. Never use a gag on a person who is ill or is suffering from allergies.\r\n\n Because a person is prevented from speaking when using a gag, he or she will be unable to utter a safeword during a scene. An alternative to the safeword should be decided on beforehand in this case. A hand signal, such as dropping a handkerchief or clenching a fist, can be used, for instance, as can eye signals, such as a series of blinks. Many BDSM players may also use a series of three grunts in place of a safeword during BDSM play involving gags."
	},{
		"name": "Handcuffs",
		"top": "handcuffing [2] partner",
		"bottom": "being handcuffed by [2] partner",
		"description": "Handcuffs are used in sex play to restrain one partner's wrists or ankles. They are comprised of two metal bracelets linked together with a chain. The handcuffs used in sex play may also be covered with a soft material to prevent chafing.\r\n\n Handcuffs can be tied in different ways: wrist to wrist, wrist to object, ankle to ankle, or ankle to object. The ratchet mechanism prevents the cuff from being removed without the key.\r\n\n Handcuffs are popular BDSM accessories. Depending on the length of the chain, it can be impossible to move one's arms or feet when wearing them. They can also be used in light bedroom bondage scenes, usually with two pairs, each attached to a wrist and an object like a bedpost.",
		"safety": "Despite their advantages in restraint, handcuffs also have disadvantages. First, they can be very painful, especially when worn for a long period of time. The metal tends to chafe the skin and hit delicate bones in the wrist or ankle. Moreover, handcuffs can only be removed with a key once they are locked. If the key is lost, there are few ways to free someone without embarrassment.\r\n\n For long-term bondage and safer play, leather bondage cuffs may be preferable."
	},{
		"name": "Nipple Clamps",
		"top": "putting clamps on [2] partner",
		"bottom": "wearing nipple clamps",
		"description": "Nipple clamps are a sex toy that squeeze erect nipples to restrict the blood flow and increase arousal. They are most often used on women but can be used on men. The nipples are highly sensitive and are considered an erogenous zone. Those who enjoy nipple clamps find that the painful pinch increases sexual stimulation. Nipple stimulation has been found to increase oxytocin levels, which can cause uterine contractions; the uterus also contracts during orgasm.\r\n\n Nipple clamps are often associated with BDSM because of the pain/pleasure aspect of the toy. Nipple clamps may also include weights attached to increase sensation.",
		"safety": "Because nipple clamps cut off blood flow to the nipples, they should be used with caution. It is recommended that they not be left on for more than five to 10 minutes at a time. For those who are able to tolerate this without issues, that time can be gradually increased."
	},{
		"name": "Restraints",
		"top": "restraining [2] partner",
		"bottom": "being restrained"
	},{
		"name": "Remote Control Devices",
		"top": "holding the remote control",
		"bottom": "wearing the device",
		"description": "A remote control sex toy is a vibrating sex toy that can be operated from a distance. Many remote control sex toys are controlled by wireless remotes which usually have buttons to turn the devices on and off and even control the speed. The actual sex toys usually consist of a small vibrating apparatus, such as a vibrating bullet, that can be worn by the recipient via straps around the waist and thighs.\r\n\n Traditionally, remote control sex toys could only be controlled from no more than a few feet away. Thanks to advances in sex toy technology, though, more modern remote control sex toys can be controlled via smartphones, Internet connections, or even video game consoles from around the world.\r\n\n Remote control sex toys are a great way to tease your partner. They can be used during dominance and submission play or just for fun. Some couples enjoy strapping on remote control sex toys before going out in public. The mere idea of getting caught having an orgasm in public and the uncertainty of when the sexual stimulation will be coming adds a certain delicious thrill to a night on the town."
	},{
		"name": "Toys",
		"top": "using toys on [2] partner",
		"bottom": "having toys used on [1]"
	},{
		"name": "Whips",
		"top": "whipping [2] partner",
		"bottom": "being whipped by [2] partner",
		"description": "A whip is a long, thin leather sex toy that is often used to inflict pain/pleasure upon a sex partner. Whipping is popular in the bondage, discipline, sadism, masochism (BDSM) community. Because pain releases endorphins in the brain, many people use painful sex toys like whips to intensify sexual pleasure.\r\n\n A whip is operated in a swift motion where the flexible end slaps the receiving partner, often creating a sharp pain, and sometimes even mild cuts or scars, on the skin.\r\n\n There are many different kinds of whips used during sex. A flogger is the best kind of whip for a person new to sadomasochism. An experienced dominant might go for a more painful and advanced type of whip, such as a single-tailed whip or a \"cat o' nine tails\" whip. It's also not uncommon to use a belt as a whip.",
		"safety": "It's important that the dominant partner knows how to use a whip properly, because improper use of a whip could result in deep lacerations. In sexual play where pain is involved, complete respect - as well as a safe word - are essential."
	},
	




	{
		"name": "Corsets",
	 	"top": "[2] partner wearing corsets",
	 	"bottom": "wearing corsets"
	},{
		"name": "High Heels",
	 	"top": "seeing [2] partner wear high heels",
	 	"bottom": "wearing high heels"
	},{
		"name": "Latex",
	 	"top": "seeing [2] partner wear latex",
	 	"bottom": "wearing latex"
	},{
		"name": "Leashes",
	 	"top": "leading [2] partner around on a leash",
	 	"bottom": "being led around on a leash by [2] partner"
	},{
		"name": "Leather",
	 	"top": "seeing [2] partner wear leather",
	 	"bottom": "wearing leather for [2] partner"
	},{
		"name": "Lingerie",
	 	"top": "seeing someone in lingerie",
	 	"bottom": "wearing lingerie for [2] partner"
	},{
		"name": "Muscles",
	 	"top": "being muscular",
	 	"bottom": "muscular partners"
	},{
		"name": "Pantyhose/Stockings",
	 	"top": "seeing [2] partner wear pantyhose/stockings",
	 	"bottom": "wearing pantyhose/stockings for [2] partner"
	},{
		"name": "Piercings",
	 	"top": "having piercings",
	 	"bottom": "partners with piercings"
	},{
		"name": "Tattoos",
	 	"top": "having tattoos",
	 	"bottom": "partners with tattoos"
	},




	
	{
		"name": "Biting",
		"aka": "Odaxelagnia",
		"top": "biting [2] partner",
		"bottom": "being bitten by [2] partner",
		"description": "Odaxelagnia is a sexual paraphilia where an individual has an unusual sexual arousal related to biting or being bitten. This particular paraphilia is often associated with sadism, masochism and vampire fetishes. That said, arousal from biting or being bitten is very common and most cases does not escalate beyond an interest and a turn-on.",
		"safety": "Biting is a fairly common fetish. Roughly half of the population has experienced some form of sexual arousal from biting. Odaxelagnia, though, is a paraphilia. This means that it is extreme or highly unusual and potentially dangerous to the fetishist. This paraphilia can be considered proportionatly more dangerous as the intensity of the sexual desire to bite or be bitten increases. Typically the fetish involves biting that does not puncture the skin and allow bloodflow."
	},{
		"name": "Choking",
		"top": "choking [2] partner sexually",
		"bottom": "being choked sexually by [2] partner",
		"description": "Choking, when used in a BDSM context, is an element of the activity known as breath control. The practice involves restriction of the breath and blood supply to the brain by applying pressure to the blood-rich carotid arteries. Most commonly, choking is done with bare hands, a forearm to the throat, known as a choke hold, or with a prop such as a scarf or length of rope.\r\n\n Many submissive individuals enjoy being choked as the practice reinforces their partner’s dominance over them. They also enjoy the lightheaded feeling that comes from choking.",
		"safety": "Choking is considered to be edge play, as the practice constricts or entirely blocks off a person’s air supply. It may cause severe and permanent damage to the carotid arteries and larynx. In severe cases it may even cause death, either directly or by bringing on a heart attack. **There is no completely safe way to choke a person**, although there are safer ways to do it. Despite this, some people still engage in choking to seek a sexual high.\r\n\n Experts agree that the best way to choke someone is to apply pressure directly to the carotid arteries on either side of the neck rather than the windpipe. These arteries carry blood rich in oxygen from the heart to the brain. When they are compressed the brain loses oxygen and accumulates carbon dioxide, which creates a giddy, euphoric feeling that heightens all the senses. These sensations will last from three to five seconds, after which the person being choked will pass out.\r\n\n Given the very high risks, choking should never be done alone. A person who chokes their partner should also be familiar with CPR. Choking a partner until they pass out should never be attempted by anyone who is not already very experienced with choking. Communication before, during, and after choking is crucial. As the person being choked will not be able to communicate verbally while being choked, it’s smart to establish a safe action to use if the person is feeling uncomfortable."
	},{
		"name": "Fingering",
		"aka": "Fingerbanging, Hand sex",
		"top": "fingering [2] partner",
		"bottom": "being fingered by [2] partner",
		"description": "Fingering refers to the use of one's fingers for sexual stimulation of the anus, labia, vulva and vagina, and/or penetration into the vagina or anus. Fingering can be performed with one or more fingers and can constitute a complete sexual encounter, or be used as part of foreplay. Because the hands are sensitive and have lots of dexterity, fingering can be very pleasurable.\r\n\n Fingering is a sexual act initiated to stimulate the genitalia or the anus. Because of the dexterity of the fingers, this technique can be used to help achieve a G-spot orgasm, which can be more difficult to accomplish via vaginal intercourse.\r\n\n Anal fingering is enjoyable for some because of the large number of nerve endings located in the anal area. Fingering is often associated with the act of making out or heavy petting. It is a very safe form of sexual play because it does not involve mucous membranes. However, it is best to practice fingering with clean hands and short finger nails. Using barriers such as gloves reduces the potential for STI transmission even further.\r\n\n Fingering is not to be confused with fisting, which is the insertion of all of the fingers of one hand (in the form of a fist) into the vagina or anus. It also differs from a hand job, which refers to manual manipulation of the penis."
	},{
		"name": "Foot worship",
		"top": "having [2] feet worshipped",
		"bottom": "worshipping [2] partner's feet"
	},{
		"name": "Handjobs",
		"aka": "Hand sex, Handy",
		"top": "giving [2] partner handjobs",
		"bottom": "receiving handjobs from [2] partner",
		"description": "A hand job, also spelled handjob, is a form of manual stimulation performed on a penis. It may be used as foreplay or may be continued to the point of orgasm and ejaculation. It involves many techniques, which differ depending on partner preferences and may or may not include stimulation of the testicles, scrotum and perineum along with the penis.\r\n\n Pleasing a partner with a hand job involves experimentation and communication. Giving a good hand job also involves getting to know your partner and becoming familiar with the male anatomy and the sensitivity of its various parts. A hand job may also differ depending on whether the person has a circumcised or uncircumcised penis.\r\n\n",
		"safety": "Because penises are not self-lubricating, lubricant is recommended for a hand job. It makes things more pleasurable, and helps ensure no painful friction is involved.\r\n\n One key benefit of a hand job is that it carries very little risk of STI transmission or pregnancy."
	},{
		"name": "Hair Pulling",
		"top": "pulling [2] partner's hair",
		"bottom": "having [2] hair pulled"
	},{
		"name": "Massages",
		"top": "massaging [2] partner",
		"bottom": "being massaged by [2] partner"
	},{
		"name": "Nipple Play",
		"aka": "Nipple stimulation",
		"top": "playing with [2] partner's nipples",
		"bottom": "having [2] nipples played with",
		"description": "Nipple stimulation is the touching, rubbing, biting, kissing or licking of the nipples or the area around the nipples, called the areola, for sexual enjoyment. Women usually get more pleasure from this type of stimulation than men, whose nipples are actually more sensitive - and usually not in a good way.\r\n\n Nipple stimulation can be used as an arousal technique in foreplay or as part of sex. It is even possible for some people to orgasm through nipple stimulation alone. Some people may call this a nipplegasm.\r\n\n Nipple stimulation is a great way to help start sex as the stimulation helps produce the chemical oxytocin, also known as the love hormone. This reduces stress and will ultimately make sex more enjoyable.\r\n\n People with larger breasts may require longer or harder touching because larger breasts tend to have less overall sensitivity. However, it's important, whatever size your breasts are, to start off slowly and gently and find your own level of enjoyment.\r\n\n How much a person enjoys nipple stimulation may also depend on the timing of their menstrual cycle; during some parts of the month, a person's nipples can become too sensitive to be touched."
	},{
		"name": "Spanking",
		"aka": "Spankophilia",
		"top": "spanking [2] partner",
		"bottom": "being spanked by [2] partner",
		"description": "Spanking, as part of sexual play, occurs when a person slaps a sex partner with an open hand or an object to heighten sexual arousal for one or both parties. This type of adult spanking is usually enjoyed by those who find sexual pleasure in strong sensations or mild discomfort. Enjoyment of pain is part of the pleasure for a smaller subset of spankees as well. It can be done during foreplay or intercourse. Spanking should be done within a consensual power power play relationship, where both parties discuss their desires and limits. Safewords and signals should be used to ensure all participants safety.\r\n\n Spanking can be done in a variety of positions. Sometimes the partner being struck is bent over a spanking bench or furniture. Over the knee spanking (OTK spanking) is also a common spanking posture.\r\n\n Many dominants use spankings during BDSM play to exert control over their submissive once the submissive consents to it. Dominants can use it to take physical control or mental control through humiliation (again, if that's what the submissive has agreed to). It is a very intimate act as it puts the bodies of a dominant and submissive in close contact. Spanking over the knee can prevent the spanker from 'mis-firing' and hitting their submissive’s lower back or thighs, which may cause damage.\r\n\n A person can spank with an open hand or a wide variety of objects including a paddle, a whip, or a cane. It may be delivered as a spontaneous smack or go on for a prolonged session over a period of time. Sometimes spanking is a part of sadomasochism or other forms of rough sex. Being spanked sparks arousal in many people because pain releases endorphins.\r\n\n Impact play in general, and OTK spanking in particular can be thrilling for dominants and their submissives. For a dominant, an over knee spanking leaves the submissive exposed in many ways. They get a great view of the submissive's behind and the damage they inflict on it. They can also easily build tension during an over the knee spanking, as the submissive cannot see the dominant and what they are doing. This means the submissive never knows when they will receive their punishment next.",
		"safety": "Over the knee spanking is relatively safe as the submissive only spanks the buttocks, which can happily take some punishment. It may create red marks, bruises or welts, but these should fade quickly. However, dominants should remember that they are in a position of power. Some dominants prefer using their hand to spank their submissive, as it gives them greater control over the intensity of each strike. They should use care when implements to ensure they don’t spank their submissive any harder than they intend. Breaking the skin can lead to infections and you must be cognizant of the risks. A cool cloth applied after the spanking can help take out some of the sting and swelling."
	},{
		"name": "Spitting",
		"top": "spitting on [2] partner",
		"bottom": "being spit on by [2] partner"
	},{
		"name": "Watersports",
		"aka": "Golden shower, Urine play, Pee Play, Piss Play",
		"top": "peeing on [2] partner",
		"bottom": "being peed on by [2] partner",
		"description": "Watersports refers to urine play, or acts that involve urinating in or on another person, or any other activity the involves pee. Individuals who participate in watersports may enjoy being urinated on or urinating on another person's body, including their face, breasts and genitals. Watersports also includes acts such as urinating in another person's rectum, vagina or mouth. These acts are often associated with BDSM. Because it can be extreme in nature (both physically and psychologically) some also consider watersports a form of edgeplay.\r\n\n Urinating on another person is seen as symbolic of possession, and it can be used as a form of punishment or humiliation. However, watersports are not only present in BDSM relationships; in vanilla relationships, people may just enjoy the warm feeling of urine on their bodies or genitals, or be turned on by the sight of their partner urinating.\r\n\n ",
		"safety": "As you can imagine, watersports can get quite messy. Many couples choose to participate in urine play while in a tub or shower because of this. Not surprisingly, urine is also an acquired taste. To minimize the shock or gag factor when first urinating in a person's mouth, the urinator can drink lots of water in an effort to dilute their urine. Note, however, that urine contains low levels of bacteria, and that some STIs could be transmitted this way."
	},
		







	{
		"name": "Creampie",
		"top": "creampie-ing [2] partner",
		"bottom": "being creampied by [2] partner",
		"description": "Creampie refers to a desired outcome in pornographic films in which ejaculate is shown to seep out of a vagina or anus. Creampie is also a fetishized act. Creampie is a relatively new phenomenon in pornography; the term itself is believed to have emerged in the early 2000s.\r\n\n Although creampie is probably a common occurrence in sex, it it believed to have become more desirable in pornography as a result of the increased use of condoms. Following the HIV crisis in the 1980s, condom use was heavily promoted, and condom use came to be more common and accepted among this generation as a result.\r\n\n As so many people became used to sex with condoms, a new genre of pornography offering something entirely different arose in the early 2000s. Creampie scenes following barrier-free ejaculation became a very popular genre because ejaculating inside another person had become a more taboo sex act.\r\n\n The creampie represented a massive change in the production of porn. In the past, ejaculation scenes in porn were focused primarily on visible moments of semen erupting from the penis, often being aimed at another performer’s face, chest/breasts or genitals. The belief was that if the orgasm was not seen, then there was no way the viewer would fully believe it had happened.\r\n\n In pornography, ejaculating on a partner is often referred to as a \"money shot.\" (Interestingly, this phenomenon is also attributed to the HIV/AIDS epidemic.) Ejaculating inside of a partner, therefore, may be called a \"reverse money shot.\" An anal creampie can also be referred to as \"breeding\" or \"seeding.\"\r\n\n Another sex act related to cream pie is felching. This is the act of someone sucking the ejaculate out of another person’s vagina or anus. Felching creampie can be a part of a domination scene, where the dom forces the sub to lick or eat their own semen out of a partner's orifice.",
		"safety": "Barrier-free ejaculation, in porn and in real life, always carries a risk of passing sexually transmitted infections between partners."
	},{
		"name": "Cunnilingus",
		"aka": "Eating pussy, Going down, Muff diving, Rug munching, Dining at the Y, Drinking from the furry cup, Having a box lunch, Pearl diving",
		"top": "performing cunnilingus on [2] partner",
		"bottom": "receiving cunnilingus from [2] partner",
		"description": "Cunnilingus is oral sex performed on a partner with a vulva. During cunnilingus, the giving partner stimulates the receiving partner’s clitoris or vulva with their mouth. Cunnilingus may be part of foreplay, sex or afterplay. A giving partner may use cunnilingus to arouse their partner, bring them to orgasm, or continue their pleasure after they’ve already had an orgasm.\r\n\n Cunnilingus is a very old word dating back to around 1884. It is a combination of the Latin word for vulva, \"cunnus,\" and the word \"lingere,\" meaning “to lick.” It’s unclear where the Latin term cunnus originated, but some language experts believe it may be an evolution of terms for gash, slit, to cut, or sheath. The use of the term cunnilingus grew steadily until the early 1960s, when it became much more widely used.\r\n\n Virtually all cultures throughout history have practiced cunnilingus. There are ancient cave paintings depicting cunnilingus and Taoist teachings declaring that ingesting vaginal fluids could make the Yang (male) essence stronger. However, it wasn’t always celebrated. The Ancient Greeks thought cunnilingus was only for lesbians or impotent men. Accusing someone of performing cunnilingus was an emasculating slur, as the dominant view was that “real men” used their penises to satisfy their partners. The Greeks and Romans also made jokes about the vulva being dirty. This idea persisted until well into the Middle Ages.\r\n\n However, attitudes have shifted. Today, cunnilingus is a mainstream form of sexual expression, as anthropologist Treena Orchard explained. \"Cunnilingus is more commonly discussed and practiced because women are speaking out more freely about what kinds of pleasure they want. This is connected with the rise in the number of influencers and authors writing about the clitoris and the orgasm gap, including Dr. Laurie Mintz, author of the best-selling book 'Becoming Cliterate: Why Orgasm Equality Matters- And How To Get It.'\""
	},{
		"name": "Double Penetration",
		"top": "double penetrating [2] partner",
		"bottom": "being double penetrated by [2] partner",
		"description": "Double penetration is a wide-ranging term that collectively refers to inserting two body parts or objects into a person for sexual pleasure. There are many different ways double penetration can be achieved in terms of what is being inserted where and by whom. Combinations of penises, fingers, fists, tongues, sex toys (including dildos, strap-ons, butt plugs and more) can be inserted simultaneously during sex. A double penetration scene can be solo, two people, or three people (adding in more folks would potentially change the number of penetrations) and involve any combination of oral, vaginal or anal penetration.\r\n\n Double penetration is not limited to any specific gender, identity or sexual orientation. Any combination of people can participate in double penetration activities. It is a fulfilling and pleasurable activity on many different levels, for both the people penetrating and those being penetrated.\r\n\n A common misconception is that double penetration specifically refers to two penises of two people being simultaneously inserted into the vagina and anus of a single person. This limiting belief is widely perpetuated by pornography in which double penetration is a significant subgenre. Frequently referred to as DP, it is often presented with one person with a penis on their back, penetrating a second person’s vagina as they face each other, with a third person on top penetrating the second person’s anus from behind. Sometimes the order is reversed and the second person faces the third person so that the first person is penetrating anally why the third person penetrates vaginally.In reality, these too frequent depictions do not come close to covering the many different possibilities of double penetration. Because double penetration can involve so many different permutations of people, orifices and objects, there are countless different positions that can be used. In fact, many people frequently participate in double penetration activities without referring to them as such.",
		"safety": "Because double penetration may involve anal touch or possibly inserting two objects in any orifice, it is important that everybody—whether you’re playing along or with others—take things slowly. In fact, it is great to start exploring double penetration as a solo act, so that you can feel what it is like to have two objects inside you (in whatever combination) to see what sex positions, angles, and objects feel the best. While porn might make it look easy, double penetration can be overwhelming for the receiver, and it might be challenging to focus on more than one object or person at the same time. And if you’re a penetrating partner in this adventure, be sure to check in and ask how your partner is doing throughout the experience.\r\n\n Two other considerations should definitely be top of mind in double penetration situations: lube and hygiene. Additional lubrication is a must for anal penetration and a great-to-have for vaginal penetration.\r\n\n At the same time, it is important to remember that care should be taken when moving from one orifice to another. Penis and toys should not go from ass to mouth or vaginal without a was or changing condoms."
	},{
		"name": "Face Sitting",
		"top": "sitting on [2] partner's face",
		"bottom": "having [2] face sat on by [2] partner",
		"description": "Facesitting is a sexual practice in which a person sits or hovers over their partner's face. This is often done to facilitate oral sex or analingus. It can also be a form of D/s or humiliation play.\r\n\n To perform facesitting, the bottom partner lies flat on their back. They might lie on the floor or a bed for comfort. Their partner straddles their face and lowers their body down into a sitting position. They may squat or kneel, but it’s a good idea for the top partner to support their own weight for safety. Top partners may face their partner’s face or feet, depending on their preference. They should position themselves so their genitals or anus are in line with the bottom partner’s mouth. In this position, the bottom partner can perform oral sex or analingus.\r\n\n Top partners may enjoy facesitting as a way to enjoy oral sex or analingus that makes them feel totally in control. Bottom partners often take pleasure from knowing how much they’re turning their partners on. Many bottom partners also enjoy the sensations that they experience during facesitting. While they are not stimulated as the top partner is, many bottom partners love the feeling of the full or partial weight of their partner on their face, the moisture from their partner’s sweat and bodily fluids on their skin, and the darkness that helps them focus on these sensations.\r\n\n Facesitting is also sometimes known as kinging or queening, depending on the gender of the person sitting on their partner’s face. That’s because the seated partner takes a dominant sitting position, as a royal does on their throne. Throning is a similar, yet gender-neutral, term for this act.\r\n\n Facesitting is sometimes a part of BDSM scenes, particularly Femdom scenes. The person who sits on their partner’s face is usually the dominant partner in these scenes. Facesitting during a BDSM scene can show a dominant partner's superiority and humiliate a submissive. They may use their submissive like human furniture, expecting them to be prepared for facesitting when they demand it. The dominant person may use bondage to physically restrain their submissive before sitting on their face. They could also simply hold them down with the weight of their own body.",
		"safety": "While it can be an erotic practice, facesitting can also be dangerous and lead to asphyxiation. To prevent this, the top partner shouldn't sit all the way onto the bottom partner's face. Rather than putting their full weight onto their partner, they should hover slightly. Taking some of the weight off their submissive partner helps them breathe more easily. Couples can use a low stool with an opening in the seat, known as a queening stool, for added safety. A special form of queening stool that locks the bottom partner in place, called a smother box, is another safe alternative.\r\n\n Facesitting involving coprophilia, especially coprophagia, where the bottom eats feces, carries an additional risk. Feces can carry bacteria and viruses, including HIV and hepatitis A. If the top partner has an infection, they could pass it on to a partner. This might occur if the bottom partner eats the infected feces or the waste comes in contact with their mouth or open wounds."
	},{
		"name": "Fisting",
		"top": "putting [2] fist inside [2] partner",
		"bottom": "being fisted by [2] partner"
	},{
		"name": "Multiple Orgasms",
		"top": "giving [2] partner multiple orgasms",
		"bottom": "experiencing multiple orgasms"
	},{
		"name": "Orgasm Control",
		"aka": "Edging, Peaking",
		"top": "controlling or restricting [2] partner's orgasms",
		"bottom": "having [2] orgasms controlled or restricted",
		"description": "Orgasm control is the sexual practice of holding oneself in a state of arousal for an extended period without achieving climax. Due to this elongated final stage of arousal, the sensations of the eventual orgasm may be amplified.\r\n\n Research has shown that orgasm control practices may help people - especially people with vaginas - learn to achieve orgasm more easily. It has also been used as a method to help people who suffer from premature ejaculation.\r\n\n Orgasm control, which is also called \"peaking\" or \"edging\" can be practiced on one's own or in partnered activity. Some people practice on their own so as to delay their orgasm with their partner. When partners play with orgasm control together they can experience the feeling of power that comes from controlling their partner's orgasm. Orgasm control is common in BDSM, where controlling another person's orgasm is used as form of domination and consensual torture. Like any form of Dominance/submission, it should only be practiced on an enthusiastic and consenting partner.\r\n\n In partnered play, one partner can provide stimulation and bring their partner right up to the moments before orgasm and then back off so that they are still stimulating their partner but not enough to bring about an orgasm.\r\n\n The edging technique of orgasm control involves one masturbating up until the instant before climax and then stopping. In the surfing technique, upon reaching the phase just prior to climax, stimulation is slowed down so the heightened level of sensation can be sustained. Either of these techniques can result in amplified orgasm."
	},{
		"name": "Pussy Worship",
		"top": "having [2] pussy worshipped",
		"bottom": "worshipping [2] partner's pussy",
		"description": "Pussy Worship is a sexual act in which all focus is on delivering pleasure to the vulva and vagina. It is an erotic and intimate form of play that exalts and honors this part of the body, showering it with adoration, devotion, and reverence.\r\n\n People can practice pussy worship through a variety of forms including pussy gazing, vulva massage, sex toys, cunnilingus, intercourse, sex orgies, and creating or consuming art celebrating the pussy. They may also praise it, complimenting the way it looks, tastes, and smells as well as its capabilities and power.\r\n\n When people practice pussy worship, they take their time with the experience. They enjoy a sensual journey without focusing on their destination. Simply looking at one another and exploring the pussy without penetration can build anticipation and intimacy.\r\n\n While the pussy is the focus of pussy worship, many people also pay homage to the entire body. Touching other parts of the body, such as the breasts, face, and stomach can show a partner you appreciate more than their pussy. It can also build their arousal before the focus turns to their genitals.\r\n\n All these practices focus on celebrating and paying reverence to the pussy and also to the person who owns it. While the ways of paying homage can be different, they share a focus on the pussy and the experience of worship."
	},{
		"name": "Rough Sex",
		"top": "treating [2] partner roughly during sex",
		"bottom": "being treated roughly during sex"
	},{
		"name": "Squirting",
		"top": "watching [2] partner squirt",
		"bottom": "squirting",
		"description": "A squirting orgasm is a female orgasm involving the squirting or gushing of a tasteless, odorless liquid from the urethra before or during climax. People usually have a squirting orgasm through dual stimulation of the G-spot and clitoris. However, some women can ejaculate through G-spot stimulation alone.\r\n\n The squirting orgasm is possibly one of the most elusive phenomena in female sexuality. Sexologists and scientists interested in female sexuality have not yet agreed on whether it exists. However, there is ample proof that women can and do squirt or gush liquid during orgasm. It's commonly thought that female ejaculate is liquid from the female prostate or Skene glands with trace amounts of urine. That said, others believe it may be just urine or perhaps something else.\r\n\n There is some speculation that some women may be able to have a squirting orgasm while others cannot. Scientists suggest the size and shape of the female prostate gland or the female prostate’s ability to produce liquid may determine whether or not women squirt.\r\n\n Expelling a small amount of milky fluid from the urethra during the climax is very common. This should not be confused with a squirting orgasm. During squirting orgasms, women expel a substantial amount of fluid. In some instances, the fluid from a squirting orgasm may fill a drinking glass."
	},






	{
		"name": "Blowjobs",
		"top": "giving [2] partner blowjobs",
		"bottom": "receiving blowjobs from [2] partner"
	},{
		"name": "CBT",
		"top": "performing CBT on [2] partner",
		"bottom": "enduring CBT for [2] partner"
	},{
		"name": "Cock Gagging",
		"top": "causing [2] partner to gag",
		"bottom": "[2] partner gagging [1]"
	},{
		"name": "Cock Worship",
		"top": "having [2] cock worshipped",
		"bottom": "worshipping [2] partner's cock"
	},{
		"name": "Deep Throating",
		"top": "using [2] partner's throat",
		"bottom": "having [2] throat used"
	},{
		"name": "Face Fucking",
		"top": "fucking [2] partner's face",
		"bottom": "having [2] face fucked"
	},{
		"name": "Facials",
		"top": "giving [2] partner a facial",
		"bottom": "receiving a facial from [2] partner"
	},
	
	



	
	
	{
		"name": "Anal Sex",
		"top": "performing anal sex on [2] partner",
		"bottom": "receiving anal sex from [2] partner"
	},{
		"name": "Ass Play",
		"top": "playing with [2] partner's ass",
		"bottom": "having [2] ass played with"
	},{
		"name": "Pegging",
		"top": "pegging [2] partner",
		"bottom": "being pegged by [2] partner"
	},












	{
		"name": "Abduction Play",
		"top": "\"abducting\" [2] partner",
		"bottom": "being \"abducted\" by [2] partner"
	},{
		"name": "Affectionate Cruelty",
		"top": "being affectionately cruel to [2] partner",
		"bottom": "receiving affectionate cruelty from [2] partner" 
	},{
		"name": "Affirmation",
		"top": "providing affirmation to [2] partner",
		"bottom": "receiving affirmation from [2] partner" 
	},{
		"name": "Aftercare",
		"top": "providing aftercare to [2] partner",
		"bottom": "receiving aftercare from [2] partner" 
	},{
		"name": "Age Play",
		"top": "being a Big to [2] partner's little",
		"bottom": "being a little to [2] partner's Big" 
	},{
		"name": "Begging",
		"top": "making [2] partner beg",
		"bottom": "being made to beg by [2] partner" 
	},{
		"name": "Bratting",
		"top": "taming bratty partners",
		"bottom": "being a bratty partner" 
	},{
		"name": "Breath Play",
		"top": "controlling or restricting [2] partner's breathing",
		"bottom": "having [2] breathing controlled or restricted" 
	},{
		"name": "Consensual Non Consent (CNC)",
		"top": "roleplaying an aggressor in a \"non-consensual\" scene with [2] partner",
		"bottom": "roleplaying a victim in a \"non-consensual\" scene with [2] partner" 
	},{
		"name": "Crying",
		"top": "bringing [2] partner to tears",
		"bottom": "being brought to tears by [2] partner" 
	},{
		"name": "Cuckoldry",
		"top": "cucking [2] partner with another person",
		"bottom": "being cucked by [2] partner with another person" 
	},{
		"name": "D/s",
		"top": "being the dominant partner",
		"bottom": "being the submissive partner" 
	},{
		"name": "Dirty Talk",
		"top": "talking dirty to [2] partner",
		"bottom": "being talked dirty to by [2] partner" 
	},{
		"name": "Discipline",
		"top": "disciplining [2] partner",
		"bottom": "being disciplined by [2] partner" 
	},{
		"name": "Fear",
		"top": "being feared",
		"bottom": "being afraid" 
	},{
		"name": "Flirting",
		"top": "flirting with [2] partner",
		"bottom": "being flirted with by [2] partner" 
	},{
		"name": "Gender Play",
		"top": "partners who play with gender",
		"bottom": "playing with gender" 
	},{
		"name": "Height Difference",
		"top": "being taller than [2] partner",
		"bottom": "being shorter than [2] partner" 
	},{
		"name": "Humiliation",
		"top": "humiliating [2] partner",
		"bottom": "feeling humiliated by [2] partner" 
	},{
		"name": "Interrogation",
		"top": "interrogating [2] partner for information",
		"bottom": "being interrogated by [2] partner for information" 
	},{
		"name": "Overpowerment",
		"top": "overpowering [2] partner",
		"bottom": "being overpowered by [2] partner" 
	},{
		"name": "Sadomasochism",
		"top": "inflicting pain on [2] partner",
		"bottom": "enduring pain inflicted by [2] partner" 
	},{
		"name": "Power Exchange",
		"top": "having more power than [2] partner",
		"bottom": "having less power than [2] partner" 
	},{
		"name": "Predator/Prey",
		"top": "hunting [2] partner like a predator",
		"bottom": "being hunted like prey by [2] partner" 
	},{
		"name": "Sensory Deprivation",
		"top": "depriving [2] partner of their senses",
		"bottom": "being deprived of [2] senses by [2] partner" 
	},{
		"name": "Teasing",
		"top": "teasing [2] partner",
		"bottom": "being teased by [2] partner" 
	},{
		"name": "Voyeurism/Exhibitionism",
		"top": "watching [2] partner in vulnerable situations",
		"bottom": "being watched by [2] partner in vulnerable situations"
	}
]